wyniki_50G_article/fio_results_xfs_nvme/block_size_4096/lab-sec-13/fio_seq_read_article_test_output.txt
seq_read_article_test: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
seq_read_article_test: Laying out IO file (1 file / 51200MiB)

seq_read_article_test: (groupid=0, jobs=1): err= 0: pid=26618: Sat Apr 19 12:38:18 2025
  read: IOPS=11.3k, BW=44.3MiB/s (46.5MB/s)(7976MiB/180001msec)
    slat (usec): min=4, max=183, avg=14.32, stdev= 4.42
    clat (usec): min=2, max=18013, avg=71.27, stdev=34.52
     lat (usec): min=42, max=18038, avg=85.58, stdev=35.30
    clat percentiles (usec):
     |  1.00th=[   49],  5.00th=[   50], 10.00th=[   51], 20.00th=[   51],
     | 30.00th=[   52], 40.00th=[   52], 50.00th=[   53], 60.00th=[   53],
     | 70.00th=[   61], 80.00th=[  111], 90.00th=[  128], 95.00th=[  131],
     | 99.00th=[  167], 99.50th=[  178], 99.90th=[  198], 99.95th=[  202],
     | 99.99th=[  233]
   bw (  KiB/s): min=42088, max=47720, per=100.00%, avg=45414.46, stdev=929.83, samples=359
   iops        : min=10522, max=11930, avg=11353.54, stdev=232.44, samples=359
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=7.34%, 100=65.27%
  lat (usec)   : 250=27.39%, 500=0.01%, 750=0.01%
  lat (msec)   : 4=0.01%, 20=0.01%
  cpu          : usr=8.21%, sys=26.59%, ctx=2041922, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2041933,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=44.3MiB/s (46.5MB/s), 44.3MiB/s-44.3MiB/s (46.5MB/s-46.5MB/s), io=7976MiB (8364MB), run=180001-180001msec

Disk stats (read/write):
  nvme0n1: ios=2039767/9, sectors=16318136/71, merge=0/1, ticks=131853/6, in_queue=131860, util=79.32%